from graph import *
def ellipse (x,y,x1,y1,a):
    for i in range(int(min(x1,x)) - int(a), int(max(x1,x)) + int(a), ++1):
        for j in range(int(min(y1,y)) - int(a), int(max(y1,y)) + int(a), ++1):
            if ((x-i)**2 + (y-j)**2)**0.5 + ((x1-i) ** 2 + (y1-j) **2) **0.5 <= a:
                point(i,j)
def ellipse1 (x,y,a,b,x1,y1): #функция для элипсов, наклоненных в правую сторону
    ellipse(131*a+x1+x, 33*b+y1+y, 121*a+x1+x, 56*b+y1+y, ((131*a-121*a) **2 + (56*b-33*b) **2) **0.5 + 0.5)
def ellipse2 (x,y,a,b,x1,y1): #Функция для элипсов, наклоненных в левую сторону
    ellipse(321*a+x1+x, 20*b+y1+y, 331*a+x1+x, 43*b+y1+y, ((321*a-331*a) **2 + (43*b-20*b) **2) **0.5 + 0.5)
def plant (a,x,b,y):
    brushColor(0, 102, 53)
    penColor(0, 102, 53)
    penSize(2)
    #Далее ветки
    polyline([(119*a+x,27*b+y),(152*a+x,30*b+y),(174*a+x,37*b+y),(199*a+x,49*b+y),(213*a+x, 58*b+y),(229*a+x,71*b+y)])
    polyline([(274*a+x,57*b+y),(286*a+x,41*b+y),(304*a+x,26*b+y),(326*a+x,14*b+y),(342*a+x,7*b+y),(362*a+x,4*b+y),(376*a+x,2*b+y)])
    polyline([(270*a+x,113*b+y),(274*a+x,103*b+y),(280*a+x,96*b+y),(287*a+x,88*b+y),(297*a+x,80*b+y),(305*a+x,76*b+y),(314*a+x,76*b+y),(321*a+x,75*b+y),(329*a+x,78*b+y),(333*a+x,79*b+y)])
    polyline([(170*a+x,105*b+y),(178*a+x,102*b+y),(187*a+x,100*b+y),(194*a+x,100*b+y),(203*a+x,102*b+y),(210*a+x,105*b+y),(220*a+x,110*b+y),(228*a+x,117*b+y),(234*a+x,123*b+y),(245*a+x,139*b+y)])
    #Далее ствол
    polygon([(254*a+x,53*b+y),(269*a+x,4*b+y),(275*a+x,7*b+y),(260*a+x,56*b+y)])
    polygon([(244*a+x,94*b+y),(256*a+x,60*b+y),(266*a+x,64*b+y),(254*a+x,98*b+y)])
    rectangle(247*a+x,105*b+y,263*a+x,165*b+y)
    rectangle(247*a+x,225*b+y,263*a+x,173*b+y)
    #Далее листья накл. вправо
    ellipse1(0,-3*b,a,b,x,y)
    ellipse1(11*a,-2*b,a,b,x,y)
    ellipse1(21*a, 0,a,b,x,y)
    ellipse1(33*a,5*b,a,b,x,y)
    ellipse1(51*a,11*b,a,b,x,y)
    ellipse1(50*a,71*b,a,b,x,y)
    ellipse1(65*a,71*b,a,b,x,y)
    ellipse1(81*a,78*b,a,b,x,y)
    #Далее листья накл. влево
    ellipse2(0,0, a, b,x,y)
    ellipse2(15*a,-10*b,a,b,x,y)
    ellipse2(24*a,-13*b,a,b,x,y)
    ellipse2(34*a,-15*b,a,b,x,y)
    ellipse2(44*a,-16*b,a,b,x,y)
    ellipse2(1*a,56*b,a,b,x,y)
    ellipse2(-13*a,56*b,a,b,x,y)
    ellipse2(-26*a,64*b,a,b,x,y)
def panda ():
    brushColor("white")
    penColor("White")
    polygon([(318,122),(328,125),(339,133),(358,171),(358,196),(356,200),(332,220),(301,220),(285,209),(281,201),(280,195),(278,157),(304,128),(316,122),(318,122)])
    ellipse(402,184,296,184,130)
    brushColor("black")
    penColor("black")
    polygon([(276,158),(271,154),(270,148),(272,138),(278,130),(291,121),(300,123),(304,127),(303,131),(276,158)])
    polygon([(340,133),(346,131),(353,133),(361,142),(363,146),(364,149),(364,225),(358,266),(335,288),(327,290),(312,286),(304,277),(304,269),(312,258),(322,249),(336,214),(351,206),(359,198),(359,169),(354,172),(350,168),(340,133)])
    ellipse(318,192,318,192,25)
    polygon([(286,173),(291,175),(293,178),(294,185),(292,194),(290,197),(286,197),(282,196),(279,192),(278,187),(278,183),(281,175),(286,173)])
    polygon([(278,191),(272,230),(274,244),(276,256),(299,271),(319,243),(318,220),(300,221),(299,219),(301,216),(301,213),(297,209),(291,208),(285,209),(281,202),(278,191)])
    polygon([(404,187),(409,191),(411,201),(411,219),(407,239),(398,256),(379,275),(368,273),(353,263),(362,235),(382,206),(397,190),(404,187)])
brushColor(255, 175, 128) #Фон
rectangle(0,0, 500, 333)
panda()
plant (1,0,1,0)
plant(0.322,89.7,0.707,71)
run()